const square = (num) => {
  return num ** 2;
 }
console.log(10 ** 2);

square(100);


// console.log();

// const  = (num) => {
//  if() {
//   return true;
//  }
//  else {
//   return false;
//  }
// }
// if () {
//   console.log(10 ** 10);
// }

// 関数をつくる
// const calculationResult = (num) => {
//    return num ** 2;
//   }

//  console.log(10 ** 10);
// 関数を呼び出して引数として100を渡す
//  calculationResult(100);
 
//  →コンソールの表示は　10000000000　になった
//  →2乗を英語でsquare

// ↓
// 修正・提出

// 引数で渡した値を二乗した計算結果を戻り値として返す関数を記述してください。
// 計算結果（関数の戻り値）はコンソールに出力してください。
// 関数の引数に「10」を渡して実行した場合、10の二乗の計算結果である「100」を戻り値として返し、コンソールに「100」と表示します。
// アロー関数またはfunctionのいずれかで関数が定義されている
// 引数の二乗の計算結果がコンソールに出力されている

// const 定数名 = (引数名) => {
//   引数を使った一連の処理  
// }
